sysbench/output_64/cacheline64/oltp-update-index.out
sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 1 tps: 183.12 qps: 183.12 (r/w/o: 0.00/183.12/0.00) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 181.61 qps: 181.61 (r/w/o: 0.00/181.61/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 173.00 qps: 173.00 (r/w/o: 0.00/173.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 175.40 qps: 175.40 (r/w/o: 0.00/175.40/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 168.20 qps: 168.20 (r/w/o: 0.00/168.20/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 168.80 qps: 168.80 (r/w/o: 0.00/168.80/0.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 1 tps: 174.20 qps: 174.20 (r/w/o: 0.00/174.20/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 180.80 qps: 180.80 (r/w/o: 0.00/180.80/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 1 tps: 180.40 qps: 180.40 (r/w/o: 0.00/180.40/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 171.39 qps: 171.39 (r/w/o: 0.00/171.39/0.00) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 1 tps: 177.20 qps: 177.20 (r/w/o: 0.00/177.20/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 1 tps: 180.61 qps: 180.61 (r/w/o: 0.00/180.61/0.00) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           10575
        other:                           0
        total:                           10575
    transactions:                        10575  (176.24 per sec.)
    queries:                             10575  (176.24 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      176.2407
    time elapsed:                        60.0032s
    total number of events:              10575

Latency (ms):
         min:                                    2.80
         avg:                                    5.67
         max:                                  210.68
         95th percentile:                        8.90
         sum:                                59984.48

Threads fairness:
    events (avg/stddev):           10575.0000/0.00
    execution time (avg/stddev):   59.9845/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 2 tps: 321.43 qps: 321.43 (r/w/o: 0.00/321.43/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 2 tps: 325.23 qps: 325.23 (r/w/o: 0.00/325.23/0.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 2 tps: 323.00 qps: 323.00 (r/w/o: 0.00/323.00/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2 tps: 326.60 qps: 326.60 (r/w/o: 0.00/326.60/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 2 tps: 356.40 qps: 356.40 (r/w/o: 0.00/356.40/0.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2 tps: 324.20 qps: 324.20 (r/w/o: 0.00/324.20/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 2 tps: 340.20 qps: 340.20 (r/w/o: 0.00/340.20/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2 tps: 346.20 qps: 346.20 (r/w/o: 0.00/346.20/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 2 tps: 350.00 qps: 350.00 (r/w/o: 0.00/350.00/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2 tps: 338.80 qps: 338.80 (r/w/o: 0.00/338.80/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 2 tps: 323.99 qps: 323.99 (r/w/o: 0.00/323.99/0.00) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 2 tps: 345.01 qps: 345.01 (r/w/o: 0.00/345.01/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           20108
        other:                           0
        total:                           20108
    transactions:                        20108  (335.10 per sec.)
    queries:                             20108  (335.10 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      335.1030
    time elapsed:                        60.0054s
    total number of events:              20108

Latency (ms):
         min:                                    2.63
         avg:                                    5.97
         max:                                  212.33
         95th percentile:                        9.91
         sum:                               119978.16

Threads fairness:
    events (avg/stddev):           10054.0000/8.00
    execution time (avg/stddev):   59.9891/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 597.48 qps: 597.48 (r/w/o: 0.00/597.48/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 597.63 qps: 597.63 (r/w/o: 0.00/597.63/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 557.60 qps: 557.60 (r/w/o: 0.00/557.60/0.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 570.00 qps: 570.00 (r/w/o: 0.00/570.00/0.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 579.61 qps: 579.61 (r/w/o: 0.00/579.61/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 575.57 qps: 575.57 (r/w/o: 0.00/575.57/0.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 588.21 qps: 588.21 (r/w/o: 0.00/588.21/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 578.02 qps: 578.02 (r/w/o: 0.00/578.02/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 608.38 qps: 608.38 (r/w/o: 0.00/608.38/0.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 580.02 qps: 580.02 (r/w/o: 0.00/580.02/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 576.99 qps: 576.99 (r/w/o: 0.00/576.99/0.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 604.59 qps: 604.59 (r/w/o: 0.00/604.59/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           35076
        other:                           0
        total:                           35076
    transactions:                        35076  (584.52 per sec.)
    queries:                             35076  (584.52 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      584.5150
    time elapsed:                        60.0087s
    total number of events:              35076

Latency (ms):
         min:                                    2.95
         avg:                                    6.84
         max:                                   56.22
         95th percentile:                       11.24
         sum:                               239968.96

Threads fairness:
    events (avg/stddev):           8769.0000/17.42
    execution time (avg/stddev):   59.9922/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 1050.31 qps: 1050.31 (r/w/o: 0.00/1050.31/0.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 1069.76 qps: 1069.76 (r/w/o: 0.00/1069.76/0.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 1003.05 qps: 1003.05 (r/w/o: 0.00/1003.05/0.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 989.60 qps: 989.60 (r/w/o: 0.00/989.60/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 896.80 qps: 896.80 (r/w/o: 0.00/896.80/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 1041.80 qps: 1041.80 (r/w/o: 0.00/1041.80/0.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 1033.22 qps: 1033.22 (r/w/o: 0.00/1033.22/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1034.40 qps: 1034.40 (r/w/o: 0.00/1034.40/0.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 1047.20 qps: 1047.20 (r/w/o: 0.00/1047.20/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 982.53 qps: 982.53 (r/w/o: 0.00/982.53/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 972.07 qps: 972.07 (r/w/o: 0.00/972.07/0.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1031.38 qps: 1031.38 (r/w/o: 0.00/1031.38/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           60771
        other:                           0
        total:                           60771
    transactions:                        60771  (1012.70 per sec.)
    queries:                             60771  (1012.70 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1012.6970
    time elapsed:                        60.0091s
    total number of events:              60771

Latency (ms):
         min:                                    3.07
         avg:                                    7.90
         max:                                  217.67
         95th percentile:                       12.75
         sum:                               479966.32

Threads fairness:
    events (avg/stddev):           7596.3750/13.37
    execution time (avg/stddev):   59.9958/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 16 tps: 1876.70 qps: 1876.70 (r/w/o: 0.00/1876.70/0.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 16 tps: 1845.82 qps: 1845.82 (r/w/o: 0.00/1845.82/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 16 tps: 1838.58 qps: 1838.58 (r/w/o: 0.00/1838.58/0.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 1930.55 qps: 1930.55 (r/w/o: 0.00/1930.55/0.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 16 tps: 1823.24 qps: 1823.24 (r/w/o: 0.00/1823.24/0.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 1811.15 qps: 1811.15 (r/w/o: 0.00/1811.15/0.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 16 tps: 1841.62 qps: 1841.62 (r/w/o: 0.00/1841.62/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 1877.66 qps: 1877.66 (r/w/o: 0.00/1877.66/0.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 16 tps: 1946.59 qps: 1946.59 (r/w/o: 0.00/1946.59/0.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 1877.75 qps: 1877.75 (r/w/o: 0.00/1877.75/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 16 tps: 1832.43 qps: 1832.43 (r/w/o: 0.00/1832.43/0.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 1897.23 qps: 1897.23 (r/w/o: 0.00/1897.23/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           112033
        other:                           0
        total:                           112033
    transactions:                        112033 (1866.86 per sec.)
    queries:                             112033 (1866.86 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1866.8570
    time elapsed:                        60.0116s
    total number of events:              112033

Latency (ms):
         min:                                    3.28
         avg:                                    8.57
         max:                                   50.71
         95th percentile:                       13.46
         sum:                               959959.66

Threads fairness:
    events (avg/stddev):           7002.0625/16.41
    execution time (avg/stddev):   59.9975/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 32 tps: 3473.33 qps: 3473.33 (r/w/o: 0.00/3473.33/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 32 tps: 3374.68 qps: 3374.68 (r/w/o: 0.00/3374.68/0.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 32 tps: 3395.06 qps: 3395.06 (r/w/o: 0.00/3395.06/0.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 3348.50 qps: 3348.50 (r/w/o: 0.00/3348.50/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 32 tps: 3190.75 qps: 3190.75 (r/w/o: 0.00/3190.75/0.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 3404.19 qps: 3404.19 (r/w/o: 0.00/3404.19/0.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 32 tps: 3034.81 qps: 3034.81 (r/w/o: 0.00/3034.81/0.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 3223.23 qps: 3223.23 (r/w/o: 0.00/3223.23/0.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 32 tps: 3373.55 qps: 3373.55 (r/w/o: 0.00/3373.55/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 3406.88 qps: 3406.88 (r/w/o: 0.00/3406.88/0.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 32 tps: 3337.28 qps: 3337.28 (r/w/o: 0.00/3337.28/0.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 2869.50 qps: 2869.70 (r/w/o: 0.00/2869.70/0.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           197205
        other:                           0
        total:                           197205
    transactions:                        197205 (3286.07 per sec.)
    queries:                             197205 (3286.07 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      3286.0741
    time elapsed:                        60.0123s
    total number of events:              197205

Latency (ms):
         min:                                    3.41
         avg:                                    9.74
         max:                                  164.09
         95th percentile:                       15.27
         sum:                              1919965.89

Threads fairness:
    events (avg/stddev):           6162.6562/17.81
    execution time (avg/stddev):   59.9989/0.00